Masmiseim36/nxpSDK/devices/MK65F18/drivers/fsl_sdhc.c
    status_t error = kStatus_Success;
    sdhc_dma_mode_t dmaMode = (sdhc_dma_mode_t)((base->PROCTL & SDHC_PROCTL_DMAS_MASK) >> SDHC_PROCTL_DMAS_SHIFT);
    sdhc_command_t *command = transfer->command;
    sdhc_data_t *data = transfer->data;

    /* make sure the cmd/block count is valid */
    if ((!command) || (data && (data->blockCount > SDHC_MAX_BLOCK_COUNT)))
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        /* Wait until command/data bus out of busy status. */
        while (SDHC_GetPresentStatusFlags(base) & kSDHC_CommandInhibitFlag)
        {
        }
        while (data && (SDHC_GetPresentStatusFlags(base) & kSDHC_DataInhibitFlag))
        {
        }

        /* Update ADMA descriptor table according to different DMA mode(no DMA, ADMA1, ADMA2).*/
        if (data && (kStatus_Success != SDHC_SetAdmaTableConfig(base, dmaMode, admaTable, admaTableWords,
                                                                (data->rxData ? data->rxData : data->txData),
                                                                (data->blockCount * data->blockSize))))
        {
            error = kStatus_SDHC_PrepareAdmaDescriptorFailed;
        }
        else
        {
            /* Send command and receive data. */
            SDHC_StartTransfer(base, command, data);
            if (kStatus_Success != SDHC_SendCommandBlocking(base, command))
            {
                error = kStatus_SDHC_SendCommandFailed;
            }
            else if (data && (kStatus_Success != SDHC_TransferDataBlocking(dmaMode, base, data)))
            {
                error = kStatus_SDHC_TransferDataFailed;
            }
            else
            {
            }
        }
    }

    return error;
}

void SDHC_TransferCreateHandle(SDHC_Type *base,
                               sdhc_handle_t *handle,
                               const sdhc_transfer_callback_t *callback,
                               void *userData)
{
    assert(handle);
    assert(callback);

    /* Zero the handle. */
    memset(handle, 0, sizeof(*handle));

    /* Set the callback. */
    handle->callback.CardInserted = callback->CardInserted;
    handle->callback.CardRemoved = callback->CardRemoved;
    handle->callback.SdioInterrupt = callback->SdioInterrupt;
    handle->callback.SdioBlockGap = callback->SdioBlockGap;
    handle->callback.TransferComplete = callback->TransferComplete;
    handle->userData = userData;

    /* Save the handle in global variables to support the double weak mechanism. */
    s_sdhcHandle[SDHC_GetInstance(base)] = handle;

    /* Enable interrupt in NVIC. */
    SDHC_SetTransferInterrupt(base, true);

    /* save IRQ handler */
    s_sdhcIsr = SDHC_TransferHandleIRQ;

    EnableIRQ(s_sdhcIRQ[SDHC_GetInstance(base)]);
}

status_t SDHC_TransferNonBlocking(
    SDHC_Type *base, sdhc_handle_t *handle, uint32_t *admaTable, uint32_t admaTableWords, sdhc_transfer_t *transfer)
{
    assert(transfer);

    sdhc_dma_mode_t dmaMode = (sdhc_dma_mode_t)((base->PROCTL & SDHC_PROCTL_DMAS_MASK) >> SDHC_PROCTL_DMAS_SHIFT);
    status_t error = kStatus_Success;
    sdhc_command_t *command = transfer->command;
    sdhc_data_t *data = transfer->data;

    /* make sure cmd/block count is valid */
    if ((!command) || (data && (data->blockCount > SDHC_MAX_BLOCK_COUNT)))
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        /* Wait until command/data bus out of busy status. */
        if ((SDHC_GetPresentStatusFlags(base) & kSDHC_CommandInhibitFlag) ||
            (data && (SDHC_GetPresentStatusFlags(base) & kSDHC_DataInhibitFlag)))
        {
            error = kStatus_SDHC_BusyTransferring;
        }
        else
        {
            /* Update ADMA descriptor table according to different DMA mode(no DMA, ADMA1, ADMA2).*/
            if (data && (kStatus_Success != SDHC_SetAdmaTableConfig(base, dmaMode, admaTable, admaTableWords,
                                                                    (data->rxData ? data->rxData : data->txData),
                                                                    (data->blockCount * data->blockSize))))
            {
                error = kStatus_SDHC_PrepareAdmaDescriptorFailed;
            }
            else
            {
                /* Save command and data into handle before transferring. */
                handle->command = command;
                handle->data = data;
                handle->interruptFlags = 0U;
                /* transferredWords will only be updated in ISR when transfer way is DATAPORT. */
                handle->transferredWords = 0U;

                SDHC_StartTransfer(base, command, data);
            }
        }
    }

    return error;
}

void SDHC_TransferHandleIRQ(SDHC_Type *base, sdhc_handle_t *handle)
{
    assert(handle);

    uint32_t interruptFlags;

    interruptFlags = SDHC_GetInterruptStatusFlags(base);
    handle->interruptFlags = interruptFlags;

    if (interruptFlags & kSDHC_CardDetectFlag)
    {
        SDHC_TransferHandleCardDetect(handle, (interruptFlags & kSDHC_CardDetectFlag));
    }
    if (interruptFlags & kSDHC_CommandFlag)
    {
        SDHC_TransferHandleCommand(base, handle, (interruptFlags & kSDHC_CommandFlag));
    }
    if (interruptFlags & kSDHC_DataFlag)
    {
        SDHC_TransferHandleData(base, handle, (interruptFlags & kSDHC_DataFlag));
    }
    if (interruptFlags & kSDHC_CardInterruptFlag)
    {
        SDHC_TransferHandleSdioInterrupt(handle);
    }
    if (interruptFlags & kSDHC_BlockGapEventFlag)
    {
        SDHC_TransferHandleSdioBlockGap(handle);
    }

    SDHC_ClearInterruptStatusFlags(base, interruptFlags);
}

#if defined(SDHC)
void SDHC_DriverIRQHandler(void)
{
    assert(s_sdhcHandle[0]);

    s_sdhcIsr(SDHC, s_sdhcHandle[0]);
}
#endif
